Backend/personalWebBackend/app/controllers/characters_controller.rb

	def index
		@characters = Character.all
---
SELECT "characters".* FROM "characters"

	def create
		whitelist = params.permit(:name, :level, :exp)
		@character = Character.create(whitelist)
---
INSERT INTO "characters" ("name", "level", "exp", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["level", 1], ["exp", 0], ["created_at", "2020-01-02 07:13:49.933365"], ["updated_at", "2020-01-02 07:13:49.933365"]]

	def show
		@character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

	def destroy
		@character = Character.find(params[:id])
		@character.delete
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 4]]