Backend/personalWebBackend/app/controllers/levels_controller.rb

	def index
		@levels = Level.all
---
SELECT "levels".* FROM "levels"

	def show
		@level = Level.find(params[:id])
---
SELECT "levels".* FROM "levels" WHERE "levels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]